---
kind: event
id: E:Autodesk.Revit.UI.UIApplication.ThemeChanged
source: html/1038e6c9-bba1-d0ec-10cf-3a4fcbcc6351.htm
---
# Autodesk.Revit.UI.UIApplication.ThemeChanged Event

Subscribe to the ThemeChanged event to be notified after the theme was changed.

## Syntax (C#)
```csharp
public event EventHandler<ThemeChangedEventArgs> ThemeChanged
```

## Remarks
This event is raised after the theme was changed.